Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedLoad
Serialization structure for AnalysisDecomposedLoad.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedLoad._AnalysisObject
The analysis object.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedLoad._ObjectAttachedToID
The identifier of the object the load is attached to.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedLoad._ObjectAttachedToType
The type of the object the load is attached to.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedLoad._ModelLoadID
The identifier of the model load.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedLoad._ModelLoadGroupID
The identifier of the model load group.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedLoad._AnalysisLoadType
The type of the analysis decomposed load.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedLoad.ToStruct(Tekla.Structures.Analysis.AnalysisDecomposedLoad)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedLoad.FromStruct(Tekla.Structures.Analysis.AnalysisDecomposedLoad)
DO NOT USE! For internal usage only!
P: P.